/*
********************************************************************************
*    Filename:   init.h
*  Created on:   2022.05.12
*      Author:   Сергей П.
* Description:   стартовая инициализация периферии контроллера
********************************************************************************
*/

#ifndef INC_START_INIT_H_
#define INC_START_INIT_H_

#define  WWDG_REFRESH    (0x7F)               /*значение для перезагрузки WWDT*/

/*******************************************************************************
* Инициализация периферии контроллера
*******************************************************************************/
void  InitStart (void);


#endif /* INC_START_INIT_H_ */

/* end file*/
