/*******************************************************************************
*    Filename:   irq.h
*  Created on:   2022.05.12
*      Author:   Сергей П.
* Description:   обработчики прерываний
********************************************************************************
*/

#ifndef INC_IRQ_H_
#define INC_IRQ_H_

#define IRQ_PA0_FLAG_ON     (1U)              /*есть необработанное прерывание*/
#define IRQ_PA0_FLAG_OFF    (0U)              /*прерывание обработано*/

#endif /* INC_IRQ_H_ */

/* end file*/






